aymanGama/Master-Embedded-System/unit 7 (Peripherals)/section3/Stm32_F103C6_Drivers/INC/lcd.h
/*
 * LCD.h
 *
 * Created: 10/29/2022 12:20:54 PM
 *  Author: Ayman
 */


#ifndef LCD_H_
#define LCD_H_

#include "stm32f103x6_gpio_Driver.h"
#include "stm32f103xx.h"
#define LCD_PORT               GPIOA
//#define DATADIR_LCD_PORT     DDRA
//#define DATADIR_LCD_CONTROL  DDRB
#define LCD_CONTROL            GPIOA
#define RS_SWITCH              GPIO_PIN_8
#define RW_SWITCH              GPIO_PIN_9
#define ENABLE_SWITCH          GPIO_PIN_10
#define DATA_SHIFT             4
#define FOUR_BIT_MODE
#define LCD_NIBBLE			GPIO_SECOND_NIBBLE
#define LCD_BYTE			GPIO_FIRST_BYTE
#define LCD_FUNCTION_8BIT_2LINES   					(0x38)
#define LCD_FUNCTION_4BIT_2LINES   					(0x28)
#define LCD_MOVE_DISP_RIGHT       					(0x1C)
#define LCD_MOVE_DISP_LEFT   						(0x18)
#define LCD_MOVE_CURSOR_RIGHT   					(0x14)
#define LCD_MOVE_CURSOR_LEFT 	  					(0x10)
#define LCD_DISP_OFF   								(0x08)
#define LCD_DISP_ON_CURSOR   						(0x0E)
#define LCD_DISP_ON_CURSOR_BLINK   					(0x0F)
#define LCD_DISP_ON_BLINK   						(0x0D)
#define LCD_DISP_ON   								(0x0C)
#define LCD_ENTRY_DEC   							(0x04)
#define LCD_ENTRY_DEC_SHIFT   						(0x05)
#define LCD_ENTRY_INC_   							(0x06)
#define LCD_ENTRY_INC_SHIFT   						(0x07)
#define LCD_BEGIN_AT_FIRST_ROW						(0x80)
#define LCD_BEGIN_AT_SECOND_ROW						(0xC0)
#define LCD_CLEAR_SCREEN							(0x01)
#define LCD_ENTRY_MODE								(0x06)
GPIO_PIN_config_t pinconfig ;


//#define EIGHT_BIT_MODE
//#define FOUR_BIT_MODE

//API
void LCD_init(void);
void LCD_CHECK_ISBUSY();
void LCD_WRITE_COMMAND (unsigned char command);
void LCD_WRITE_CHAR (unsigned char data);
void LCD_WRITE_STRING (char* data);
void LCD_clear_screen();







#endif /* LCD_H_ */
